{
  "name": "Ancient Monastery",
  "description": "Perched atop a rugged hill, the Ancient Monastery stands as a timeless testament to faith and solitude. Its stone walls, weathered by centuries, encircle serene gardens and sacred halls where echoes of chants and wisdom still resonate. Within its embrace, the Crusaders find a moment of respite amidst the turbulence of their campaign, seeking solace and inspiration.",
  "matches": [
    {
      "name": "Meditative Reflection",
      "dice": [1],
      "description": "Enter the hallowed halls to engage in quiet reflection, restoring your group's morale and fortitude.",
      "rewards": [
        {"name": "morale", "delta": 1}
      ]
    },
    {
      "name": "Study Ancient Texts",
      "dice": [2, 2],
      "description": "Dedicate time to studying the monastery's ancient texts, gaining insight into forgotten wisdom and tactical knowledge.",
      "rewards": [
        {"name": "knowledge", "delta": 1}
      ]
    },
    {
      "name": "Assist Monks",
      "dice": [1, 3],
      "description": "Lend a helping hand to the monks in their daily tasks, earning their gratitude and fostering a sense of camaraderie.",
      "rewards": [
        {"name": "morale", "delta": 1},
        {"name": "knowledge", "delta": 1}
      ]
    },
    {
      "name": "Restore Garden",
      "dice": [3, 3],
      "description": "Collaborate with the monks to restore the monastery's gardens, creating a tranquil oasis that lifts spirits and strengthens resolve.",
      "rewards": [
        {"name": "morale", "delta": 2}
      ]
    },
    {
      "name": "Spiritual Guidance",
      "dice": [1, 2, 3],
      "description": "Seek counsel from the monastery's spiritual leaders, receiving guidance that elevates the Crusader group's morale and determination.",
      "rewards": [
        {"name": "morale", "delta": [1, 2]}
      ]
    },
    {
      "name": "Protect the Sanctuary",
      "dice": [0, 0],
      "description": "Threats approach the monastery. Stand as its guardian and repel any danger to ensure the sanctity of this sacred place.",
      "rewards": [
        {"name": "morale", "delta": 2}
      ]
    },
    {
      "name": "Search for Hidden Chambers",
      "dice": [0, 3],
      "description": "Uncover the secrets held within the monastery's hidden chambers, discovering valuable artifacts that can aid the Crusaders.",
      "rewards": [
        {"name": "knowledge", "delta": [1, 2]}
      ]
    }
  ]
}
