{
  "name": "Dragon's Lair",
  "description": "Within the heart of a forbidding mountain range, the Dragon's Lair lies shrouded in mystery and danger. Ancient legends speak of a fearsome dragon that guards untold treasures, its fiery breath and colossal might presenting a formidable challenge for any who dare approach. The Crusaders stand at the precipice, ready to face this legendary adversary and claim victory for their cause.",
  "matches": [
    {
      "name": "Distract with Fireworks",
      "dice": [1],
      "description": "Launch a dazzling display of fireworks to momentarily distract the dragon, allowing your group to evade its fiery assault.",
      "rewards": [
        {"name": "protection", "duration": "1 turn", "description": "Evade the dragon's attack for 1 turn."}
      ]
    },
    {
      "name": "Rain of Arrows",
      "dice": [2, 2],
      "description": "Rain a barrage of arrows upon the dragon, exploiting its vulnerability and weakening its defenses.",
      "rewards": [
        {"name": "damage", "damage": 3, "description": "Deal 3 damage to the dragon."}
      ]
    },
    {
      "name": "Bolster the Defenses",
      "dice": [1, 3],
      "description": "Strengthen your group's defenses by fortifying your positions, shielding yourselves from the dragon's attacks.",
      "rewards": [
        {"name": "protection", "duration": "2 turns", "description": "Gain enhanced protection for 2 turns, reducing incoming damage."}
      ]
    },
    {
      "name": "Lure with Bait",
      "dice": [3, 3],
      "description": "Lay out a tempting feast to lure the dragon's attention away from your group, giving you a tactical advantage.",
      "rewards": [
        {"name": "damage", "damage": 2, "description": "Deal 2 damage to the dragon."},
        {"name": "protection", "duration": "1 turn", "description": "Evade the dragon's attack for 1 turn."}
      ]
    },
    {
      "name": "Fatal Blow",
      "dice": [0, 0],
      "description": "Seize a moment of vulnerability to deliver a fatal blow to the dragon, vanquishing the ancient menace once and for all.",
      "rewards": [
        {"name": "monument", "description": "Erect a monument to your victory, providing a permanent upgrade to your group's strength."}
      ]
    }
  ]
}
